       77  WRK-NUMERO       PIC  9(03)        VALUE ZEROS.
       77  WRK-RESULTADO    PIC  9(03)        VALUE ZEROS.
       77  WRK-CONTADOR     PIC  9(03)        VALUE ZEROS.
