      ******************************************************************
      *AUTHOR..: DANILLO
      *OBJETIVO: MOSTRAR A STRING HELLO ALURA
      *DATA....: 24/08/21
      *
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
